system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-0.50 0.0 0.0)    // 0 inlet bottom
    ( 0.00 0.0 0.0)    // 1 plate leading edge
    ( 3.00 0.0 0.0)    // 2 plate trailing edge

    (-0.50 0.8 0.0)    // 3 inlet top
    ( 0.00 0.8 0.0)    // 4 top over LE
    ( 3.00 0.8 0.0)    // 5 outlet top

    (-0.50 0.0 0.01)   // 6
    ( 0.00 0.0 0.01)   // 7
    ( 3.00 0.0 0.01)   // 8

    (-0.50 0.8 0.01)   // 9
    ( 0.00 0.8 0.01)   // 10
    ( 3.00 0.8 0.01)   // 11
);

blocks
(
    hex (0 1 4 3 6 7 10 9)  (80 220 1)  simpleGrading (1 18605 1)
    hex (1 2 5 4 7 8 11 10) (720 220 1) simpleGrading (1 18605 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 9 6)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 8 11 5)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (3 4 10 9)
            (4 5 11 10)
        );
    }

    prePlate
    {
        type symmetryPlane;
        faces
        (
            (0 6 7 1)
        );
    }

    plate
    {
        type wall;
        faces
        (
            (1 7 8 2)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (6 9 10 7)
            (7 10 11 8)
        );
    }
);

mergePatchPairs
(
);
