0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (60 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (60 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (60 0 0);
        value           uniform (60 0 0);
    }

    top
    {
        type            symmetryPlane;
    }

    prePlate
    {
        type            symmetryPlane;
    }

    plate
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
